In [ ]:
Create and import file
1. Create schoolmets and collegements friends_names.xls file and import file in spyder (atleast 10 names, columns are FriendName,Quality) ,
2. Summarize data by quality wise no.of friends .
Example: quality | no.of freind
			funny | 2

In [37]:
import pandas as pd
df1=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\schoolmets_names.xlsx")
df1

  friendsname      Quality
0      Sushma       Topper
1       Bhanu  Intilligent
2     Madhuri         Good
3    Shakeera        Smili
4    Shamshad     Innocent

In [9]:
import pandas as pd
df2=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\collegemets_names.xlsx")
df2

  friendsname      Quality
0       Aruna     Innocent
1     Gayatri       Silent
2    Anuradha      Commedy
3        Rupa  Intilligent
4    Nagamani         Good

In [11]:
df1.groupby("Quality")["friendsname"].count()

Quality
Good           1
Innocent       1
Intilligent    1
Smili          1
Topper         1
Name: friendsname, dtype: int64

In [12]:
df2.groupby("Quality")["friendsname"].count()

Quality
Commedy        1
Good           1
Innocent       1
Intilligent    1
Silent         1
Name: friendsname, dtype: int64

In [ ]:
Create boys Boysfriend_names.xls file and import file in spyder (atleast 10 names, columns are FriendName,Quality)  
2. Summarize data by quality wise no.of friends .
3. Create girls Girlsfriend_names.xls file  and import file in spyder (atleast 10 names, columns are FriendName,Quality) 
4. Summarize data by quality wise no.of friends .

In [16]:
import pandas as pd
df=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\Boysfriendsname_Quality.xlsx")
df

  Boysfriendsname      Quality
0        santhosh       topper
1           khaja       comedy
2           imran       silent
3           siraj  intilligent
4            azam    tallented
5          sadhiq  intilligent
6           ishan        anger

In [17]:
import pandas as pd
df1=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\Girlsfriendsname_Quality.xlsx")
df1

  Girlsfriendsname      Quality
0           anusha    tallented
1         nasheena  intillegent
2          parveen       topper
3          jayasri  intillegent
4            durga       silent
5           reshma      commedy

In [19]:
df.groupby("Quality")["Boysfriendsname"].count()

Quality
anger          1
comedy         1
intilligent    2
silent         1
tallented      1
topper         1
Name: Boysfriendsname, dtype: int64

In [20]:
df1.groupby("Quality")["Girlsfriendsname"].count()

Quality
commedy        1
intillegent    2
silent         1
tallented      1
topper         1
Name: Girlsfriendsname, dtype: int64

In [ ]:
>Create and import file
1. Create a father side fatherfamily_members.xls file and import file in spyder  (atleast 5 names, columns are FamilyMemberName*Relation)
2. Summarize data by relation wise no.of familymembers .
3. Create a mother side montherfamily_members.xls file and import file in spyder  (atleast 5 names, columns are FamilyMemberName*Relation)
4. Summarize data by relation wise no.of familymembers .

In [22]:
import pandas as pd
df2=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\Father_familymembers.xlsx")
df2

  family_members     relation
0        Basheer        uncle
1         Sammad  grandfather
2        Khadeer        uncle
3         Hafees    pedananna
4          Ayyub    pedananna
5        basheer  grandfather
6          Ayyub        uncle

In [26]:
import pandas as pd
df3=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\Mother_familymembers.xlsx")
df3

  family_members     relation
0       shakeera        aunty
1    ameerunnisa  grandmother
2      rahamatha        aunty
3         rahima       sister
4        farjana       sister
5       shakeera       sister
6      rahamatha        aunty

In [25]:
df2.groupby("relation")["family_members"].count()

relation
grandfather    2
pedananna      2
uncle          3
Name: family_members, dtype: int64

In [28]:
df3.groupby("relation")["family_members"].count()

relation
aunty          3
grandmother    1
sister         3
Name: family_members, dtype: int64

In [ ]:
Create and import file
1. Create a Dal related  dal_items.xlsx file and import file in spyder (atleast 5 names, columns are VegFoodName*Taste)
2. Summarize data by taste wise no.of fooditems.
3. Create a vegitable related  vegitable_items.xlsx file and import file in spyder (atleast 5 names, columns are VegFoodName*Taste)
4. Summarize data by taste wise no.of fooditems.

In [32]:
import pandas as pd
df4=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\daal_items.xlsx")
df4

   daal_items     taste
0  tomatodaal      good
1   mangodaal  verygood
2   moongdaal     spicy
3        daal      good
4    daalsoup     salty

In [33]:
import pandas as pd
df5=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\vegfood_item.xlsx")
df5

          veg_items   taste
0       potatochips  sality
1   panneer biryani   spicy
2  mashroom biryani  sality
3          babycorn  crispy
4       ladysfinger   curry
5            potato     fry
6           brinjal     fry
7           brinjal    soup

In [35]:
df4.groupby("taste")["daal_items"].count()

taste
good        2
salty       1
spicy       1
verygood    1
Name: daal_items, dtype: int64

In [36]:
df5.groupby("taste")["veg_items"].count()

taste
crispy    1
curry     1
fry       2
sality    2
soup      1
spicy     1
Name: veg_items, dtype: int64

In [ ]:
Create and import file
1. Create a soups related  soups_items.xlsx file and import file in spyder (atleast 5 names, columns are soups*Taste)
2. Summarize data by taste wise no.of fooditems.
3. Create a fry related  fry_items.xlsx file and import file in spyder (atleast 5 names, columns are fry*Taste)
4. Summarize data by taste wise no.of fooditems.

In [38]:
import pandas as pd
df=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\soup_items.xlsx")
df

           soups     Taste
0    tomato soup   awesome
1       veg soup   average
2   chicken soup      nice
3    mutton soup  delicios
4  mushroom soup     tasty

In [39]:
import pandas as pd
df1=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\fry_items.xlsx")
df1

     fry_items     Taste
0  chicken fry  delicios
1   mutton fry   awesome
2   prawns fry      nice
3     fish fry      good
4      veg fry     tasty

In [40]:
df.groupby("Taste")["soups"].count()

Taste
average     1
awesome     1
delicios    1
nice        1
tasty       1
Name: soups, dtype: int64

In [43]:
df1.groupby("Taste")["fry_items"].count()

Taste
awesome     1
delicios    1
good        1
nice        1
tasty       1
Name: fry_items, dtype: int64

In [ ]:
Create and import file
1. Create a Chicken related chicken_items.xlsx file and import file in spyder (atleast 5 names, columns are NonVegFoodName*Taste)
2. Summarize data by taste wise no.of fooditems.
3. Create a mutton related mutton_items.xlsx file and import file in spyder (atleast 5 names, columns are NonVegFoodName*Taste)
4. Summarize data by taste wise no.of fooditems.

In [48]:
import pandas as pd
df_chicken_items=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\non_vegitems.xlsx")
df_chicken_items

        chicken_items      Taste
0          chicken 65       good
1     chicken biryani    awesome
2     chicken chillii      tasty
3         chicken fry       nice
4  chicken manchurian  delicious

In [46]:
import pandas as pd
df_mutton_items=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\non_vegitems.xlsx",sheet_name="Sheet2")
df_mutton_items

    mutton_items      Taste
0    muttoncurry  delicious
1  muttonbiryani      tasty
2      muttonfry       nice
3    muttonkeema       good

In [50]:
df_chicken_items.groupby("Taste")["chicken_items"].count()

Taste
awesome      1
delicious    1
good         1
nice         1
tasty        1
Name: chicken_items, dtype: int64

In [51]:
df_mutton_items.groupby("Taste")["mutton_items"].count()

Taste
delicious    1
good         1
nice         1
tasty        1
Name: mutton_items, dtype: int64

In [ ]:
Create a winter season  winterseason_names.xlsx file and import file in spyder  (atleast 2 names, columns are MonthName*Season)
2. Summarize data by Season wise no.of months.
3. Create a summer season  summerseason_names.xlsx file and import file in spyder  (atleast 2 names, columns are MonthName*Season)
4. Summarize data by Season wise no.of months.
5. Create a rainy season  rainyseason_names.xlsx file and import file in spyder  (atleast 2 names, columns are MonthName*Season)
6. Summarize data by Season wise no.of months.

In [53]:
import pandas as pd
df_winterseason_names=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\monthnames_seasons.xlsx")
df_winterseason_names

  monthnames seasons
0   november  winter
1   december  winter
2    january  winter

In [55]:
import pandas as pd
df_summerseason_names=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\monthnames_seasons.xlsx",sheet_name="Sheet2")
df_summerseason_names

  monthnames seasons
0      april  summer
1        may  summer

In [56]:
import pandas as pd
df_rainyseason_names=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\monthnames_seasons.xlsx",sheet_name="Sheet3")
df_rainyseason_names

  monthnames seasons
0       july   rainy
1     august   rainy
2  september   rainy

In [57]:
df_winterseason_names.groupby("seasons")["monthnames"].count()

seasons
winter    3
Name: monthnames, dtype: int64

In [58]:
df_summerseason_names.groupby("seasons")["monthnames"].count()

seasons
summer    2
Name: monthnames, dtype: int64

In [59]:
df_rainyseason_names.groupby("seasons")["monthnames"].count()

seasons
rainy    3
Name: monthnames, dtype: int64

In [ ]:
Create and import file
1. Create a red colour flowers redflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
2. Summarize data by color wise no.of flowers.
3. Create a white colour flowers whiteflowers_names.xlsx file  and import file in spyder  (atleast 3 names, columns are FlowerName*color)
4. Summarize data by color wise no.of flowers.
5. Create a pink colour flowers whiteflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
6. Summarize data by color wise no.of flowers.
7. Create a yellow colour flowers whiteflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
8. Summarize data by color wise no.of flowers.

In [60]:
import pandas as pd
df_redcolourflower_names=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\flowersnames_colours.xlsx")
df_redcolourflower_names

       flowernames colour
0             rose    red
1             Rose    Red
2  Cardinal flower    Red
3        Amaryllis    Red

In [61]:
import pandas as pd
df_whitecolourflower_names=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\flowersnames_colours.xlsx",sheet_name="Sheet2")
df_whitecolourflower_names

  flowernames colour
0        rose  white
1       lilly  white
2     jasmine  white
3       desai  white

In [62]:
import pandas as pd
df_pinkcolourflower_names=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\flowersnames_colours.xlsx",sheet_name="Sheet3")
df_pinkcolourflower_names

  flowernames colour
0        rose   pink
1   Carnation   Pink
2    Dianthus   Pink
3      Dahlia   Pink

In [64]:
import pandas as pd
df_yellowcolourflower_names=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\assignment_13\flowersnames_colours.xlsx",sheet_name="Sheet4")
df_yellowcolourflower_names

   flowernames  colour
0         rose  yellow
1    Sunflower  yellow
2     Marigold  yellow
3  Coneflowers  yellow

In [65]:
df_redcolourflower_names.groupby("colour")["flowernames"].count()

colour
Red    3
red    1
Name: flowernames, dtype: int64

In [66]:
df_whitecolourflower_names.groupby("colour")["flowernames"].count()

colour
white    4
Name: flowernames, dtype: int64

In [67]:
df_pinkcolourflower_names.groupby("colour")["flowernames"].count()

colour
Pink    3
pink    1
Name: flowernames, dtype: int64

In [68]:
df_yellowcolourflower_names.groupby("colour")["flowernames"].count()

colour
yellow    4
Name: flowernames, dtype: int64